app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT 1
---
  def find_artist
    @artist = Artist.find_by(id: params[:id])

SELECT "artists".* FROM "artists"
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" IS NULL LIMIT 1
---
  def index
    @artists = Artist.all
    @organization = Organization.find_by(id: session[:organization_id])