app/controllers/organizations_controller.rb

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" IS NULL LIMIT 1
---
  def find_organization
    @organization = Organization.find_by(id: params[:id])